package com.example.rwpc.lawapplication;

import android.content.Intent;
import android.net.Uri;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.ListView;
import android.widget.Toast;

public class WebActivity extends AppCompatActivity {
 //   static final int READ_BLOCK_SIZE=100;
    ListView listView;


  //  TextView te;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_web);
        listView = (ListView)findViewById(R.id.list);

        String[] values = new String[] { "          ","സ്ത്രീകളും നിയമങ്ങളും",
                " കേരള വനിതാകമ്മീഷൻ  ",
                "ജീവനാംശ നിയമങ്ങൾ",
                "ഹിന്ദു നിയമം",
                " മകൻ// ഭാര്യക്ക് ജീവനാംശം  ",
                "കുട്ടികൾക്കുളള ജീവനാംശം",
                "മുസ്ലീം നിയമം ",
                "മുസ്ലീം സ്ത്രീ(വിവാഹ മോചന സംരക്ഷണാവകാശം) നിയമം",
                "മക്കളുടെ ജീവനാംശം",
                "മാതാപിതാക്കളുടെ സംരക്ഷണം",
                "സ്ത്രീകൾക്ക് എതിരായ കുറ്റകൃത്യങ്ങൾ",
                "ഇന്ത്യൻ ശിക്ഷാനിയമം-(IPC):-",
                "ബലാൽസംഗവും ശിക്ഷയും",
                "പ്രത്യേകതരം ബലാൽസംഗകേസുകൾ",
                "വിവാഹ സംബന്ധമായ കുറ്റകൃത്യങ്ങൾ",
                "സ്ത്രീധന മരണം ",
                "സ്ത്രീധന നിരോധന നിയമം-1961",
                "സ്ത്രീധനം നീർവചനം",
                "തൊഴിൽ സ്ഥതത്തെ ലൈംഗിക പീഡനം:-\n" +
                        "വൈശാഖ കേസിലെ സുപ്രീം കോടതി വിധി",
                "ലൈംഗിക പീഡനങ്ങൾ എന്തൊക്കെ ഉൾപ്പെടും",
                "സ്ഥലപരിശോധനയും ശരീര പരിശോധനയും ",
                "തെളിവ് നൽകുന്നതിന് സ്റ്റേഷനിൽ ഹാജരാക്കൽ",
                "ഗാർഹിക പീഡന നിരോധന നിയമം"

        };

        ArrayAdapter<String> adapter = new ArrayAdapter<String>(this,
                android.R.layout.simple_list_item_1, values);


        listView.setAdapter(adapter);


        listView.setOnItemClickListener(new AdapterView.OnItemClickListener() {

            public void onItemClick(AdapterView<?> parent, View view,
                                    int position, long id) {
                if (position==0) {
                    Intent myintent = new Intent(view.getContext(), Scrolling1Activity.class);
                    myintent.putExtra("id","                  സ്ത്രീകളും നിയമങ്ങളും \n" +
                            "നിയമം എന്നത് ഒരു സമൂഹം അതിലെ അംഗങ്ങളുടെ മേൽ സ്വയം നിയന്ത്രിക്കുന്നതിനായി ഉണ്ടാക്കിയ ഒരു രൂപരേഖയാണ്.ഭരണകൂടം അവരുടെ പ്രജകളുടെ മേൽ ഉണ്ടാക്കുന്ന നിയന്ത്രങ്ങളിൽ നിന്നോ ആചാരങ്ങളിൽ നിന്നോ നിയമം ഉണ്ടാകാം നിയമം ഒരു വ്യക്തിയുടെ ബാഹ്യമായ ചേഷ്ടകളെയും വ്യവഹാരങ്ങളേയും നിയന്ത്രിക്കുന്നു.എന്നാൽ ധാർമികത മനസാക്ഷിയോടാണ് കടപ്പെട്ടിരിക്കുന്നത്.പ്രായം ചെന്ന ഒരാൾ റോഡ് മുറിച്ചു കടക്കാൻ ശ്രമിക്കുമ്പോൾ അയാളെ സഹായിക്കേണ്ടത് നമ്മുടെ ബാദ്ധ്യതയാണ്.എന്നാൽ നിയമപരമായി അങ്ങിനെ ചെയ്യാൻയാതോരു ബാധ്യതയും നമുക്കില്ല.\n" +
                            "         സ്ത്രീകൾക്ക് മാന്യമായും മനസമാധനത്തോടെയും കഴിയാൻ പറ്റുന്ന ഒരു സമൂഹത്തിനുമാത്രമേ പരിഷ്ക്യത സമൂഹം എന്ന് അവകാശപ്പെടാൻ ആവുകയുളളൂ.സ്ത്രീയുടെ സുരക്ഷ എന്നത് സാമൂഹ്യ ബാധ്യതയാണെങ്കിലും നിയമപരമായി പരിരക്ഷ ലഭിക്കാതെ ആധുനിക സമൂഹത്തിൽ സ്ത്രീകൾ സുരക്ഷതരായിരിക്കുകയില്ല.ഇങ്ങിനെ സ്ത്രീകളുടെ സാംസ്കാരികവും ഭൌതികവുമായ അസ്തിത്വം നിലനിർത്തുന്നതിനും സമൂഹത്തിൽ മാന്യമായ സ്ഥാനം ഉറപ്പാക്കുന്നതിനും അനേകം പോരാട്ടങ്ങളിലൂടെ സാമൂഹ്യ സുരക്ഷനിയമങ്ങളുടെ ഭാഗമായി സ്ത്രീ-സുരക്ഷിതത്വം ഉറപ്പുവരുത്തുന്ന പല നിയമങ്ങളും നമ്മുടെ രാജ്യത്ത് നിലവിലുണ്ട്.അവയിൽ പ്രധാനം നമ്മുടെ ഭരണഘടനതന്നെ.ഭരണഘടനയുടെ മൌലികവകാശങ്ങളിൽ സ്ത്രീയും പുരുഷനും തുല്യസ്ഥാനം നൽകുന്നു.ലിംഗ വിവേചനം പാടില്ല എന്ന് നമ്മുടെ ഭരണഘടന നിഷ്കർഷിക്കുന്നു അതുപോലെ സ്ത്രീകളുടെ അവകാശ സംരക്ഷണത്തിനായി പ്രത്യേക നിയമ നിർമ്മാണം നടത്താൻ അനുഛേദം 15(3) ഭരണകൂടത്തിന് അധികാരം നൽകുന്നുണ്ട്.ഭരണഘടനയുടെ നിർദ്ദേശ തത്വങ്ങളുടെ അടിസ്ഥാനത്തിലാണ് തുല്യജോലിക്ക് തുല്യവേതനം, സാമൂഹ്യ സുരക്ഷാനിയമങ്ങൾ എന്നിവ ഉണ്ടാക്കിയിട്ടുളളത്.\n" +
                            "       സ്ത്രീകളുടെ അന്തസ്സും അഭിമാനവും ഉയർത്തിപ്പിടിക്കുന്നതിന് ആവശ്യമായ അന്തരീക്ഷം സ്യഷ്ടിക്കുക എന്നത് ഓരോ പുരുഷൻ//യും കടമയാണെന്ന് ഭരണഘടന നമ്മെ ഓർമ്മപ്പെടുത്തുന്നു.നിയമപരമായി സ്ത്രീകൾക്ക് എന്തൊക്കെ ആനുകുല്യങ്ങൾക്ക് അർഹത ഉണ്ട് എന്നറിയുകയും അവ പ്രാവർത്തികമാറുന്ന ഏജൻസികളെയും അധികാരികളെയും കുറിച്ച് മനസ്സിലാക്കുകയും ചെയ്താൽ മാത്രമേ സ്ത്രീകൾക്കു നേരെയുളള ചൂഷണത്തിൽ നിന്നും മോചനം സാധ്യമാവുകയുളളൂ.  ");
                    startActivityForResult( myintent,0);


                }
                if (position==1) {
                    Intent myintent = new Intent(view.getContext(), Scrolling1Activity.class);
                    myintent.putExtra("id","1. ഭരണഘടനയിലും മറ്റു നിയമങ്ങളിലും സ്ത്രീകളുടെ സംരക്ഷണത്തിനായി പ്രതിപാദിച്ചിരിക്കുന്ന വിഷയങ്ങളെക്കുറിച്ച് പരിശോധിച്ച് അനേഷണം നടത്തുക.\n" +
                            "2. സ്ത്രീകളുടെ സംരക്ഷണത്തിനായി നടത്തുന്ന ഇത്തരം അനേഷണ റിപ്പോർട്ടുകളും നിർദേശങ്ങളും സർക്കാരിന് സമർപ്പിക്കുക.\n" +
                            "3. സ്ത്രീസംരക്ഷണത്തിനായി ഭരണഘടനയിലെയും ബന്ധപ്പെട്ട നിയമങ്ങളിലെയും വകുപ്പുകൾ കാലകാലങ്ങളിൽ പുനഃപരിശോധന നടത്തുകയും ഏതെങ്കിലും പഴുതുകളോ, കുറവുകളോ ഉണ്ടെങ്കിൽ അവ മാറ്റാനാവശ്യമായ നടപടികൾ സ്വീകരിച്ച് ഭേദഗതിക്കൾ വരുത്തുവാൻ ആവശ്യപ്പെടുക.\n" +
                            "4. സ്ത്രീകളുടെ അവകാശലംഘനം, അവരുടെ സംരക്ഷണം, സമത്വം, വികസനം എന്നിവ ഉറപ്പുവരുത്തുന്ന നിയമങ്ങൾ നടപ്പിലാക്കാനുളള നടപടികൾ സ്വീകരിക്കുക.ഇവ സംബന്ധിച്ച പരാതിക്കൾ ഉണ്ടെങ്കിൽ, അയത് പരിശോദിക്കുകയും ചെയ്യുക.\n" +
                            "5. സ്ത്രീകൾക്ക് എതിരെ ഉണ്ടാകുന്ന ആസൂത്രണങ്ങളെയും വിവേചനത്തെയും അവയിൽ നിന്നുണ്ടാകുന്ന പ്രത്യേക പ്രശ്നങ്ങളെയും സാഹചര്യങ്ങളെയും കുറിച്ച് പഠനങ്ങളോ അന്വേഷണങ്ങളോ നടത്തുക, പരിഹാരങ്ങൾ നിർദ്ദേശിക്കുക.\n" +
                            "6. വിവിധ മേഖലകളിൽ സ്ത്രീകളുടെ പ്രാതിനിധ്യം ഉറപ്പുവരുത്താനുളള ഗവേഷണങ്ങൾ നടത്തിക്കുകയും അവരുടെ ഉന്നമനത്തിനുളള മാർഗ്ഗങ്ങൾ കണ്ടെത്തുക.\n" +
                            "7. സ്ത്രീകളുടെ ഉന്നമന പ്രവർത്തനങ്ങളുടെ വളർച്ചയെക്കുറിച്ച് വിലയിരുത്തുക.\n" +
                            "8. സ്ത്രീകളുടെ സാമൂഹിക-സാമ്പത്തിക ഉന്നമനത്തിനായുളള ആസൂത്രണ പ്രക്രിയയിൽ പങ്കെടുത്ത് ഉപദേശങ്ങൾ നൽകുക.\n" +
                            "9.സ്ത്രീകളെ പാർപ്പിക്കുന്ന വീടുകൾ, ജയിലുകൾ, സ്ഥാപനങ്ങൾ എന്നിവ പരിശോധിച്ച് ആവശൃമായ നിർദ്ദേശങ്ങൾ നൽക്കുക.\n" +
                            "10. സ്ത്രീ സമൂഹത്തിൻ\u200D\u200D// പ്രശ്നങ്ങളിൽ കേസ് നടത്തുന്നതിനുളള ധനസഹായ മാർഗ്ഗങ്ങൾ കണ്ടെത്തുക.\n" +
                            "11. സ്ത്രീകളുടെ പ്രവർത്തനങ്ങളെക്കുറിച്ചും പ്രശ്നങ്ങളെക്കുറിച്ചും കഷ്ടപ്പാടുകളെക്കുറിച്ചും സർക്കാറിന് കാലകാലങ്ങളിൽ റിപ്പോർട്ട് നൽകുക.\n" +
                            "12. അന്വേഷണത്തിൻ// ഭാഗമായി കമ്മീഷൻ കേസ് നടത്തുമ്പോൾ സിവിൽ കോടതിയുടെ അധികാരമുണ്ട് പ്രത്യേകിച്ച്.\n" +
                            "13. ഇന്തൃയുടെ ഏത് ഭാഗത്തുനിന്നും  ഒരു വൃക്തിയെ സമൻസ് ആയച്ച് വിളിപ്പിക്കാനും സത്യം ചെയ്യിച്ച് മൊഴിയെടുക്കാനും\n" +
                            "14. ഏതെങ്കിലും രേഖകൾ കണ്ടെത്താനും ഹാജരാക്കാനും സത്യവാങ്മൂലം വഴി തെളിവ് സ്വീകരിക്കാനും\n" +
                            "15. പൊതു രേഖകളോ, പകർപ്പോ കോടതികളിൽ നിന്നോ മറ്റേതെങ്കിലും ഓഫീസിൽ നിന്നോ ആവശ്യപ്പെടാനും\n" +
                            "16.രേഖകൾ പരിശോധിക്കുന്നതിനോ വ്യക്തികളെ വിസ്തരിക്കുന്നതിനോ കമ്മീഷൻ നിയമിക്കുന്നതിനും അധികാരംമുണ്ട്.\n");
                    startActivityForResult( myintent,0);


                }

                if (position==2) {
                    Intent myintent = new Intent(view.getContext(), Scrolling1Activity.class);
                    myintent.putExtra("id","     കേരള വനിതാകമ്മീഷൻ  \n" +
                                    "സംസ്ഥാനതലത്തിലും വനിതാകമ്മീഷൻ പ്രവർത്തിക്കുന്നുണ്ട്.അദ്ധ്യക്ഷയും രണ്ട് മെംബർമാരും ചേർന്ന സംസ്ഥാനകമ്മീഷനും ദേശീയ കമ്മീഷൻ// അതേ അധികാരംമുണ്ട്.1990ലെ കേരള വനിതാകമ്മീഷൻ// നിയമ പ്രകാരമാണ് ഇത് നിലവിൽ വന്നത്. \n");
              startActivityForResult( myintent,1);
                }
               if (position==3) {
                   Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                   myintent.putExtra("id","ജീവനാംശ നിയമങ്ങൾ\n" +
                           "ജീവനാംശം(Maintenance) എന്ന പദംകൊണ്ട് സംരക്ഷംണം എന്നാണ് ഉദേശിക്കുന്നത്.സാമൂഹ്യ സുരക്ഷിതത്വത്തിന് അനിവാര്യമായ ഈ അശയം വളരെ പുരതാനമാണ്.ഇന്ത്യയിൽ ക്രിമിനൽ നടപടിക്രമ നിയമം 125-ാം വകുപ്പ് എല്ലാ മതവിഭാഗങ്ങൾക്കും പൊതുവായിട്ടുളളതാണ്.പുരുഷന് ഭാര്യയേയും മക്കളേയും സംരക്ഷിക്കാനുളള ബാദ്ധ്യത ഉണ്ട്.വിവാഹമോചിത ആയ ഭാര്യയും ഇതിൽ ഉൾപ്പെടുമെങ്കിലും മതിയായ കാരണമില്ലാതെ ഭർത്താവിനെ പിരിഞ്ഞ് ജീവിക്കുന്നവളോ, വ്യദീചാരിണി ആയി നടക്കുന്നവളോ ആയ ഭാര്യക്ക് ഭർത്താവിൽ നിന്ന് സംരക്ഷണ ചെലവിന് അവകാശമില്ല.നിയമാനുസൃതമല്ലാതെ ഉണ്ടാകുന്ന കുട്ടികൾക്കും ചെലവിന് നൽകാൻ പിതാവ് ബാദ്ധ്യസ്ഥനാണ്.സ്വയം വരുമാനമില്ലാത്ത വ്യദ്ധരായ മാതാപിക്കാൾക്ക് വരുമാനമുളള ആൺമക്കളിൽ നിന്നോ പെൺമക്കളിൽ നിന്നോ അവർ വിവാഹിതരാണെങ്കിലും അല്ലെങ്കിലും ജീവനാംശം  അവശ്യപ്പെടാം.\n" +
                           "       ജീവനാംശം എന്നതിൽ ഭക്ഷണം, വസ്ത്രം, പാർപ്പിടം, വിദ്യാഭ്യാസച്ചെലവ്, വൈദ്യപരിശോധന, മരുന്ന്, ആരോഗ്യപരിപാലന ചെലവുകൾ എന്നിവർ ഉൾപ്പെടുന്നു.ജീവിക്കാനുളള അടിസ്ഥാന ആവശ്യങ്ങളാണ് ഇതിൽ ഉൾപ്പെടുന്നത്.ആൺമക്കൾക്ക് പ്രായപൂർത്തി ആകുന്നതുവരെയും പെൺമക്കൾക്ക് വിവാഹം കഴിയുന്നതുവരെയും  ജീവനാംശം നൽകാൻ പിതാവ് ബാദ്ധ്യസ്ഥനാണ്.\n");
                   startActivityForResult( myintent,2);
                }
                if (position==4) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","   ഹിന്ദു നിയമം\n" +
                            "ജീവിതകാലം മുഴുവൻ ഹിന്ദുഭാര്യക്ക് ഭർത്താവിൽ നിന്നും ജീവനാംശം ലദിക്കാനുളള അർഹത നിയമം അസനിഗ്ധമായി പ്രഖ്യാപിക്കുന്നുണ്ട്.താഴെ പറയുന്ന സാഹചര്യത്തിൽ ഭാര്യ ഭർത്താവിൽ നിന്ന് വേർപിരിഞ്ഞ് താമസിക്കുകയാണെങ്കിൽ പോലും ജീവനാംശം ലദിക്കാൻ അർഹതയുണ്ട്.\n" +
                            "അകാരണമായയും ഭാര്യയുടെ സമ്മതമില്ലാതെയും ഉപേക്ഷിക്കുക.മനപൂർവ്വം ഭാര്യയെ ഭർത്താവ് അവഗണിക്കുക.\n" +
                            "ഭർത്താവിൻ// ക്രൂരമായ പെരുമാറ്റം നിമിത്തം ഭാര്യക്ക് ഭർത്താവിനോടുത്തുളള ജീവിതം സാധ്യമാകാതെ വരിക\n" +
                            "മാനസികമായും ശാരീരികമായും പീഡനം, ഭർത്താവിൻ//യും കുടുംബാംഗങ്ങളുടെയും മന:പൂർവ്വമായുളള നിന്ദിക്കുന്ന പെരുമാറ്റങ്ങൾ, ഭർത്താവ്  മനപൂർവ്വ സംദോഗത്തിലേർപ്പെടാതിരിക്കുക.\n" +
                            "ഭർത്താവിന് മറ്റൊരു ഭാര്യ ഉണ്ടായിരിക്കുകയോ, ഒരേ വീട്ടിൽ വെപ്പാട്ടി ഉണ്ടായിരിക്കുക.\n" +
                            "ഭർത്താവ് ഹിന്ദുമതം ഉപേക്ഷിക്കുക\n" +
                            "\n");

                    startActivityForResult( myintent,3);
                }
                if (position==5) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","   മകൻ// ഭാര്യക്ക് ജീവനാംശം  \n" +
                            "മരിച്ചുപോയ മകൻ// ഭാര്യയെ അച്ഛൻ ജീവനാംശം നൽകി സംരക്ഷിക്കണം എന്ന് നിബന്ധന ഉണ്ട്. വിധവക്ക് സ്വയം സംരക്ഷണത്തിന് വകയില്ലെങ്കിൽ ഭർത്താവിൻ// അച്ഛനിൽ നിന്നും മകൻ// ഭാര്യക്ക് ജീവനാംശം അവകാശപ്പെടാം.\n");
                    startActivityForResult( myintent,4);
                }
                if (position==6) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","കുട്ടികൾക്കുളള ജീവനാംശം\n" +
                            "നിയമപ്രകാരമോ അല്ലാതെയോ ഉളള എല്ലാ മക്കളെയും തൻ/// ജീവിതകാലയളവിൽ ചെലവിന് കൊടുത്ത് സംരക്ഷിക്കാനുളള ബാദ്ധ്യത ഒരു ഹിന്ദുവിനുണ്ട്.വിവാഹം കഴിഞ്ഞിട്ടില്ലാത്ത പ്രായപൂർത്തിയായ മകൾക്കും മാതാപിതാക്കളോട് ജീവനാംശം അവകാശപ്പെടാം.മരിച്ചുപോയ ഒരു ഹിന്ദുവിൻ// അവകാശികൾക്ക് മരിച്ചയാളുടെ ഭാര്യയെ സംരക്ഷിക്കാനുളള ബാദ്ധ്യത ഉണ്ട്.ദത്തെടുക്കൽ ജീവനാംശ നിയമപ്രകാരം വ്യദ്ധരും നിലാരംബരുമായ മാതാപിതാക്കളേയും രണ്ടാനമ്മയേയും സംരക്ഷിക്കേണ്ടതുണ്ട്.\n");
                    startActivityForResult( myintent,5);
                }
                if (position==7) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","  മുസ്ലീം നിയമം \n" +
                            "മുസ്ലീം വ്യക്തി നിയമം അനുസരിച്ച് ഭാര്യയെ സംരക്ഷിക്കേണ്ട ബാദ്ധ്യത ഭർത്താവിനാണ്.എത്ര തന്നെ ധനികയും വരുമാനം ഉളളവളുമാണ് ഭാര്യ എന്നാലും കഴിവില്ലാത്ത, ആരോഗ്യമില്ലാത്ത, പണമില്ലാത്ത ഭർത്താവിനെ സംരക്ഷിക്കേണ്ട ബാദ്ധ്യത ഭാര്യക്കില്ല.എന്നാൽ ഭാര്യ എത്ര മാത്രം ധനിക ആയാലും ഭാര്യക്ക് ജീവിത ചെലവ് നൽകാൻ ഭർത്താവിന് ബാദ്ധ്യത ഉണ്ട്.\n");
                    startActivityForResult( myintent,6);
                }
                if (position==8) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","മുസ്ലീം സ്ത്രീ(വിവാഹ മോചന സംരക്ഷണാവകാശം) നിയമം   \n" +
                            "പാർലമെൻറ്// പാസ്സാക്കിയ ഈ നിയമം തലാക്ക് കൊണ്ട് വിഷമംമനുഭവിക്കുന്ന മുസ്ലീം സ്ത്രീകൾക്ക് വലിയ  ഒരു അശ്വാസമാണ്.വിവാഹ സമയത്തോടനുബന്ധിച്ചോ അതിനുശേഷമോ ലഭിച്ച വസ്തുക്കൾ “ഈ” കാലയളവിലെക്കുളള ചെലവുകൾ , ഭാവി സംരക്ഷണത്തിനായുളള മൊത്തമായ തുക, ബാക്കി കിട്ടാനുളള മഹർ എന്നിവയാണ് പ്രസ്തുത നിയമത്തിലെ മൂന്നാം വകുപ്പു പ്രകാരം വിവാഹ മോചിത ആയ മുസ്ലീം സ്ത്രീകൾക്ക് മുൻ ഭർത്താവിൽ നിന്നും ലദിക്കാനുളള ആനുകൂല്യങ്ങൾ,\n" +
                            "       മൊഴിചൊല്ലപ്പെടുമ്പോൾ ഭാര്യ ഗർഭിണിയോ അതല്ലെങ്കിൽ രണ്ടു വയസ്സിൽ താഴെ പ്രായമുളള കുട്ടിയുടെ അമ്മയോ ആണെങ്കിൽ കുട്ടിക്ക് രണ്ട് വയസ്സുവരെ മുല ഊട്ടുന്നതിനായി  പ്രത്യേക ആനുകൂല്യം മൊഴിചൊല്ലപ്പെട്ട ഭാര്യക്ക് നൽകുവാൻ മുൻ ഭർത്താവിന് ബാന്ധ്യത ഉണ്ടെന്ന് ഈ നിയമം പറയുന്നു.\n" +
                            "        ഭർത്താവിൻ// സാമ്പത്തിക സ്ഥിതി, ഇരുവരും  ഒരുമിച്ചു ജീവിക്കുമ്പോൾ ഉണ്ടായിരുന്ന ജീവിത നിലവാരം കുടുംബ മഹിമ എന്നിവ അടിസ്ഥാനമാക്കിയാണ് വകൂപ്പ് മൂന്നിലെ ആനുകൂല്യങ്ങൾ കോടതി നിശ്ചയിക്കുന്നത് വിവാഹ മോചിത ആയ സ്ത്രീക്ക് ഒന്നാം ക്ലാസ് മജീസ്ട്രേറ്റ് കോടതി മുൻപാകെ ഈ നിയമമനുസരിച്ച് ഹർജി നൽകിയാൽ എതിർ കഷിക്ക് നോട്ടീസ് ആയക്കുകയും ഇരുഭാഗത്തിൻ//യും വാദമുഖങ്ങൾ കേട്ടശേഷം തെളിവിൻ// അടിസ്ഥാനത്തിൽ. തുക നിശ്ചയിക്കുകയും ചെയും.ഭർത്താവ് പണം നൽകാത്തപക്ഷം അയാൾക്ക് ജയിൽ ശിക്ഷ ലദിക്കും.ഭർത്താവിൽ നിന്നും ജീവനാംശം ലഭിക്കാത്ത സ്ത്രീക്ക് അവരുടെ ഏറ്റവും അടുത്ത ബന്ധുക്കളിൽ നിന്നും ചെലവിന് ലഭിക്കാൻ കോടതിയിൽ അപേക്ഷനൽകാനും ബന്ധുക്കൾ നിരാലംബർ ആണെങ്കിൽ സംസ്ഥാന വകുപ്പ് ബോർഡ് ആ സ്ത്രീയെ സംരക്ഷിക്കണം എന്നാണ് നിയമം.ഒരു തരത്തിലും ഒരു സ്ത്രീയും സംരക്ഷിക്കാതെ പോകരുത് എന്നാണ് ഈ നിയമത്തിൻ/// തൽപര്യം.\n");
                    startActivityForResult( myintent,7);
                }
                if (position==9) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","മക്കളുടെ ജീവനാംശം:-   ശിശുക്കളുടെ ജീവിത ചെലവ് വഹിക്കേണ്ടത് പിതാവാണ്.വിവാഹം കഴിയുന്നതുവരെ പെൺമക്കളേയും, പ്രായപൂർത്തിയാകുന്നതുവരെ ആൺ മക്കളെയും സംരക്ഷിക്കേണ്ട ബാന്ധ്യത പിതാവിനാണ്.കൂടാതെ വിധവയോ, വിവാഹ മോചിതയോ ആയ മകളേയും കുഞ്ഞിനെയും സംരക്ഷിക്കേണ്ട ചുമതല പിതാവിനാണ്.\n");
                    startActivityForResult( myintent,8);
                }
                if (position==10) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","മാതാപിതാക്കളുടെ സംരക്ഷണം:-   സാമ്പത്തിക, ലിംഗഭേദമന്യെ നിർധനരും നിരാലംബരുമായ മാതാപിതാക്കളെ സംരക്ഷിക്കേണ്ടത് മക്കളുടെ കടമയാണ്.ക്രീസ്ത്യാനികൾക്ക് പ്രത്യേകമായ ജീവനാംശ നിയമം ഇല്ല.എന്നാൽ ക്രിമിനൽ നടപടിക്രമ നിയമം 125-ാം വകുപ്പ് ക്രിസ്ത്യാനികൾക്കും ബാധകം അണ്.\n");
                    startActivityForResult( myintent,9);
                }
                if (position==11) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","സ്ത്രീകൾക്ക് എതിരായ കുറ്റകൃത്യങ്ങൾ\n" +
                            "സമൂഹത്തിൽ ഏറ്റവുമധികം പീഡനങ്ങൾ ഏറ്റുവാങ്ങുന്നത് സ്ത്രീകളാണ്.ശാരീരികാവസ്ഥയും ദൌതിക സാഹചാര്യത്തിൻ// പരിമിതികളും സ്ത്രീകൾക്കെതിരെയുളള കൈയേറ്റങ്ങൾക്ക് ഒരു പരിധിവരെ കാരണമാകുന്നുണ്ട്.സ്ത്രീകൾക്കെതിരെയുളള ഇത്തരം കൈയേറ്റങ്ങളെ കർശനമായി നേരിടേണ്ടത് സമൂഹ ബാദ്ധ്യതയാണ്.സ്ത്രീകളുടെ സംരക്ഷണത്തിനായി അനേകം നിയമങ്ങൾ നമ്മുടെ നാട്ടിലുണ്ട്.\n");
                    startActivityForResult( myintent,10);
                }
                if (position==12) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","ഇന്ത്യൻ ശിക്ഷാനിയമം-(IPC):-\n" +
                            "    ഒരു സ്ത്രീയുടെ മാന്യതക്ക് കോട്ടം തട്ടുന്ന രീതിയിൽ ഒരുവാക്ക് ഉച്ചരിക്കുകയോ, അല്ലെങ്കിൽ ഒരു ആംഗ്യം കാണിക്കുകയോ അതുമല്ലെങ്കിൽ സ്ത്രീയെ അപമാനിക്കുന്നതിനായി ഒരു വസ്തു പ്രദർശിപ്പിക്കുകയോ ചെയ്യുകയാണെങ്കിൽ ഇന്ത്യൻ ശിക്ഷാനിയമം 509-ാം വകുപ്പ് പ്രകാരം ഒരു വർഷം വരെ തടവോ  പിഴയോ രണ്ടുംകൂടിയോ ശിക്ഷ ലഭിക്കാവുന്നതാണ്.\n" +
                            "     ഒരു സ്ത്രീയുടെ മാന്യതക്ക് കോട്ടം തട്ടുന്ന വിധത്തിൽ അവയെ കൈയേറ്റം ചെയ്യാൻ ശ്രമിക്കുകയോ അതിനായി ബലപ്രയോഗം നടത്തുകയോ ചെയ്യുന്നത് ഇന്ത്യൻ ശിക്ഷാനിയമം 354-ാം വകുപ്പുപ്രകാരം 2വർഷംവരെ തടവും അല്ലെങ്കിൽ പിഴയും അല്ലെങ്കിൽ രണ്ടുംകൂടിയും ലഭിക്കാവുന്ന കുറ്റകൃത്യമാണ്.ബഹുമാനപ്പെട്ട സുപ്രീംകോടതിയുടെ നിരീക്ഷണം ഒരു സ്ത്രീ അപമാനിക്കപ്പെട്ടുവെന്ന് ആ സ്ത്രീക്ക് തോന്നിയാൽ ഈ വകുപ്പുപ്രകാരം അതിന് കാരണക്കാരായവരെ ശിക്ഷിക്കാവുന്നതാണ് എന്നാണ്.\n");
                    startActivityForResult( myintent,11);
                }
                if (position==13) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","ബലാൽസംഗവും ശിക്ഷയും\n" +
                            "സ്ത്രീകൾക്കെതിരെയുളള ഏറ്റവും ഹീനമായ ഒരു കുറ്റമാണ് ബലാൽസംഗം.ഒരു പുരുഷൻ ബലാൽക്കാരമായി സ്ത്രീയുടെ വ്യക്തിത്വത്തിൻമേൽ അവളുടെ സമ്മതമില്ലാതെ നടത്തുന്ന ഹീനമായ ലൈഗിക വേഴ്ചയാണ് ബലാൽസംഗം.\n" +
                            "      ഇന്ത്യൻ ശിക്ഷാനിയമം 375-ാം വകുപ്പുപ്രകാരം ഒരു പുരുക്ഷൻ പ്രത്യേകമായി വിവരിച്ചിട്ടുളള പരിതസ്ഥിതികളിലേതെങ്കിലും ഒരു സ്ത്രീയുമായ് ലൈംഗിക വേഴ്ച നടത്തുമ്പോൾ അത് ബലാൽസംഗം ആകുന്നു.\n" +
                            "അവളുടെ ഇച്ഛക്കെതിരായി\n" +
                            "അവളുടെ സമ്മതം കൂടാതെ\n" +
                            "അവളുടെ സമ്മതത്തോടെയാണെങ്കിലും ആ സമ്മതം നേടിയത് ഭരണഭയം ഉളവാക്കിയാണെങ്കിൽ\n" +
                            "അവളെ വിവാഹം കഴിക്കാം എന്ന് പറഞ്ഞ് വിശ്വസിപ്പിച്ച് \n" +
                            "ബുദ്ധിസ്ഥിരത ഇല്ലായ്മകൊണ്ടോ, ലഹരിക്കടിമപ്പെട്ടോ സംഭവത്തിൻ// ഗൌരവം ഉൾക്കൊളളാതെയുളള സമ്മതത്തോടെ\n" +
                            "16 വയസ്സിൽ താഴെയാണെങ്കിൽ അവളുടെ സമ്മതം ഉണ്ടായാലും ഇല്ലെങ്കിലും\n" +
                            "   എന്നാൽ ഒരു പുരുഷൻ 15 വയസ്സിൽ താഴെയല്ലാത്ത തൻ/// ഭാര്യയുമായി ലൈംഗിക വേഴ്ച നടത്തുന്നത് ബലാൽസംഗം ആകില്ല.\n" +
                            "     ബലാൽസംഗകുറ്റം ചെയ്യത ഏതൊരാൾക്കും 7വർഷത്തിൽ കുറയാത്തതും 10വർഷംവരെ ആകാവുന്നതുമായ ശിക്ഷലഭിക്കും.കൂടാതെ പിഴ ശിക്ഷയ്ക്കും ഇയാൾ അർഹനായിരിക്കുന്നതാണ്.\n");
                    startActivityForResult( myintent,12);
                }
                if (position==14) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","പ്രത്യേകതരം ബലാൽസംഗകേസുകൾ\n" +
                            "376-ാം വകുപ്പിൻ// രണ്ടാം ഉപവകുപ്പിൽ പറയുന്ന പ്രത്യേകതരം ബലാൽസംഗ കേസുകൾ താഴെ പറയുന്നു.\n" +
                            "ഒരു പോലിസ് ഉദ്യോഗസ്ഥൻ സ്റ്റേഷൻ പരിസരത്തുവച്ച് നടത്തുന്നതോ ആല്ലെങ്കിൽ തൻ//യോ തൻ// കീഴുദ്യോഗസ്ഥൻ///യോ കസ്റ്റഡിൽ ഉളള ഒരു സ്ത്രീയുടെമേൽ നടത്തുന്നതോ ആയ ലൈഗിക വേഴ്ച. \n" +
                            "ഒരു പൊതുസേവകൻ ആ നിലയ്ക്ക് തൻ// അധിനതയിലുളളതോ തൻ// തൻ// കീഴുദ്യോഗസ്ഥൻ///യോ കസ്റ്റഡിൽ ഉളള ഒരു സ്ത്രീയുടെമേൽ നടത്തുന്നതോ ആയ ലൈഗിക വേഴ്ച. \n" +
                            "ജയിലിലോ, റിമാൻ// ഹോമിലോ ഉളള ഉദ്യോഗസ്ഥർ തൻ// കിഴിലുളള ഇത്തരം സ്ഥാപനത്തിലെ അന്തേവാസിയുടെമേൽ നടത്തുന്ന ലൈംഗിക വേഴ്ച.\n" +
                            "ഒരു ആശുപത്രിയുടെ മാനേജ്മെൻ/// ,സ്റ്റാഫിലോ പെട്ടആൾ തൻ// മേൽ പദവിമുതലെടുത്ത് ആശുപത്രിയിൽ വെച്ച് ഒരു സ്ത്രീക്കെതിരെ നടത്തുന്ന ലൈംഗിക വേഴ്ച്ച.\n" +
                            "ഒരു സ്ത്രീ ഗർഭിണി ആണെന്നറിഞ്ഞുകൊണ്ട് അവളുടെമേൽ നടത്തുന്ന ലൈംഗികവേഴ്ച്ച.\n" +
                            "12 വയസ്സിൽ താഴെയുളള കുട്ടിയുടെ മേൽ നടത്തുന്ന ലൈംഗികവേഴ്ച്ച.\n" +
                            "കൂട്ട ബലാൽസംഗം ഒരു സ്ത്രീയെ ഒരു സംഘത്തിൽപെട്ട ഒന്നോ അതിലധികമോ ആളുകൾ നടത്തുന്ന ബലാൽസംഗം.\n" +
                            "   മേൽ പറഞ്ഞ കുറ്റകൃത്യം ചെയ്യുന്ന ആളെ പത്തുവർഷത്തിൽ കുറയാത്ത കഠിന തടവ് ശിക്ഷിക്കെണ്ടതാണെന്നും പിഴ ശിക്ഷയും അയാൾക്ക് ലഭിക്കേണ്ടതാണെന്നും നിയമത്തിൽ വ്യവസ്ഥ ചെയ്യ്തിട്ടുണ്ട്.\n" +
                            "        ബലാൽസംഗ കേസിൽ സ്ത്രീയുടെ മൊഴിയും, വിചാരണയും രഹസ്യ സ്വഭാവത്തോടെയാണ് രേഖപ്പെടുത്തുന്നത്.\n");
                    startActivityForResult( myintent,14);
                }
                if (position==15) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","വിവാഹ സംബന്ധമായ കുറ്റകൃത്യങ്ങൾ  \n" +
                            "ഭർത്താവോ ഭാര്യയോ ജീവിച്ചിരിക്കെ മറ്റെരു വിവാഹം കഴിക്കുന്നത് 7 വർഷം വരെ തടവ് ലഭിക്കാവുന്ന  കുറ്റകൃത്യമാണ്.എന്നാൽ ഇത് മുസ്ലീം പുരുഷൻമാർക്ക് ബാധകമല്ല.ആദ്യ വിവാഹം മറച്ചുവച്ചുകൊണ്ട് രണ്ടാം വിവാഹം കഴിക്കുന്നത് 10 വർഷംവരെ തടവും പിഴയും ലഭിക്കാവുന്ന കുറ്റമാണ്.നിയമപരമായി വിവാഹം കഴിക്കാതെ ഒരു സ്ത്രീയെ ഭാര്യയാണെന്നു പറഞ്ഞ് വിശ്വസിപ്പിച്ച് കൂടെ താമസിപ്പിച്ച് ലൈംഗിക ബന്ധത്തിലേർപ്പെടുന്ന പുരുഷന് 10 വർഷംവരെ തടവു ശിക്ഷ ലഭിക്കും.നിയമസാധ്യത ഇല്ലെന്നറിഞ്ഞുകൊണ്ട് വഞ്ചിക്കണമെന്ന ഉദ്ദേശ്യത്തോടെ സത്യവിരുദ്ധമായ വിവാഹം ചെയ്യുന്നത് 7 വർഷംവരെ തടവും പിഴയും ലഭിക്കുന്ന കുറ്റമാണ്.\n" +
                            "       ഒരു സ്ത്രീ മറ്റൊരാളുടെ ഭാര്യയാണെന്നറിഞ്ഞുകൊണ്ടു തന്നെ ലൈംഗിക ബന്ധത്തിൽ ഏർപ്പെടുന്നത് 5 വർഷംവരെ തടവോ, പിഴയോ രണ്ടുംകൂടിയോ ലഭിക്കാവുന്ന കുറ്റമാണ്.വിവാഹിതയായ ഒരു സ്ത്രീയെ ഭർത്താവിൽ നിന്നും അകറ്റി നിർത്തി അവിഹിത വേഴ്ച നടത്തണമെന്ന ഉദ്ധേശ്യത്തോടെ തടഞ്ഞ് വെക്കുന്നതും ഇന്ത്യൻ ശിക്ഷാനിയമം 498 പ്രകാരം രണ്ടുവർഷം വരെ തടവോ പിഴയോ ലഭിക്കാവുന്ന കുറ്റകൃത്യമാണ്.\n" +
                            "       ഒരു സ്ത്രീയോട് ഭർത്താവോ ഭർത്താവിൻ/// വീട്ടുകാരോ, ബന്ധുക്കളോ ക്രൂരമായ പെരുമാറുന്നത് ശിക്ഷാർഹമാണ്.(498(A).വകുപ്പ്) പണവും സ്വത്ത് വകകളും ആവശ്യപ്പെട്ട് നടത്തുന്ന മാനസിക-ശാരിരീക പീഡനവും ഈ വകുപ്പിൽ പെടുന്നു.\n");
                    startActivityForResult( myintent,15);
                }
                if (position==16) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","സ്ത്രീധന മരണം \n" +
                            "വിവാഹിതയായി ഏഴ് വർഷത്തിനകം സ്ത്രീധനവുമായി ബന്ധപ്പെട്ടോ സ്ത്രീധനം ആവശ്യപ്പെട്ടുകൊണ്ടോ ഭർത്താവിൻ///യോ ഭർത്താവിൻ/// ബന്ധുക്കളുടെ പീഡനമോ ക്രൂരമായ പെരുമാറ്റമോ മൂലമോ ഒരു സ്ത്രീ അസാധാരണമായ സാഹചര്യത്തിൽ മരണപ്പെട്ടാൽ ഭർത്താവിനും ബന്ധുക്കൾക്കുമെതിരെ സ്ത്രീധന മരണമെന്ന കുറ്റത്തിന് കേസെടുക്കാവുന്നതാണ്.ഇന്ത്യൻ ശിക്ഷാനിയമം 304(B) വകുപ്പുപ്രകാരം ഏഴ് വർഷത്തിൽ കുറയാതെയും ജീവപര്യന്തംവരെയോ തടവുശിക്ഷ ലഭിക്കാവുന്ന കുറ്റകൃത്യമാണിത്.\n" +
                            "     ഇന്ത്യൻ ശിക്ഷാനിയമം 306-ാം വകുപ്പുപ്രകാരം ഒരു വ്യക്തിയെ ആത്മഹത്യക്ക് നയിക്കുന്നത് പത്ത് വർഷംവുരെ തടവും പിഴയും ലഭിക്കാവുന്ന കുറ്റമാണ്.\n");
                    startActivityForResult( myintent,16);
                }
                if (position==17) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","സ്ത്രീധന നിരോധന നിയമം-1961\n" +
                            "സ്ത്രീധന സമ്പ്വദായം എന്ന സാമൂഹിക വിപത്ത് ഇല്ലാതാക്കൽ ആണ് ഈ നിയമം 1961-ൽ കൊണ്ടു വന്നത്.സ്ത്രീധനം കൊടുക്കുന്നതും വാങ്ങുന്നതും തടയുക എന്നതാണിതിൻ//// ലക്ഷ്യം.1985-ൽ കേന്ദ്ര ഗവൺമെൻ/// ഇതുമായി ബന്ധപ്പെട്ട് ചട്ടങ്ങളും നിർമിക്കുകയുണ്ടായി.\n");
                    startActivityForResult( myintent,17);
                }
                if (position==18) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","സ്ത്രീധനം നീർവചനം\n" +
                            "വിവാഹ ബന്ധത്തിലെ ഒരുപക്ഷം മറുപക്ഷത്തിനോ വിവാഹിതരാകുന്ന വ്യക്തികളുടെ മാതാപിതാക്കളോ മറ്റു വ്യക്തികളോ വിവാഹിതരാകുന്നവർക്കോ മറ്റു വ്യക്തികൾക്കോ  വിവാഹസമയത്തോ അതിനുമുൻപോ ശോഷമോ വിവാഹവുമായി ബന്ധപ്പെട്ട് നൽകുന്ന സ്വത്തോ വിലമതിക്കുന്ന വസ്തുക്കളോ നേരിട്ടോ അല്ലാതെയോ നൽകുന്നതിനെയാണ് സ്ത്രീധനം എന്ന പദം കൊണ്ട് അർത്ഥമാകുന്നത്.\n" +
                            "        എന്നാൽ മുസ്ലീം വ്യക്തി നിയമത്തിൻ/// പരിധിയിൽ വരുന്ന മഹർ അഥവാ ഡവർ ഈ നിർവ്വചനത്തിൽപെടുന്നില്ല. സ്ത്രീധനം വാങ്ങുന്നതും, നൽകുന്നതും, വാങ്ങുവാനും നൽകുവാനും പ്രേരിപ്പിക്കുന്നതും സ്ത്രീധനം ആവശ്യപ്പെടുന്നതും നിയമപരമായി കുറ്റകരമാണ്.അഞ്ച് വർഷത്തിൽ കുറയാത്ത തടവും പതിനയ്യായിരം രൂപയിൽ കുറയാത്തതോ സ്ത്രീധനത്തിന് തുല്യമോ ഏതാണോ കൂടുതൽ അത്രയും തുക പിഴയിനത്തിലും ശിക്ഷ വിധിക്കാം.\n" +
                            "      വിവാഹ സമയത്ത് വധുവിനോ വരനോ നൽകപ്പെടുന്ന സമ്മാനങ്ങളെ സ്ത്രീധനത്തിൻ/// പരിധിയിൽ നിന്ന് ഒഴിവാക്കിയിട്ടുണ്ട്.എന്നാൽ താഴെ പറയുന്ന കാര്യങ്ങൾ പാലിക്കപ്പെട്ടാൽ മാത്രമേ ഈ ആനുകൂല്യം ലഭിക്കുകയുളളൂ.\n" +
                            "സമ്മാനങ്ങൾ അവകാശമായി ആവശ്യപ്പെട്ടതാകരുത്.\n" +
                            "സ്ത്രീധന നീരോധന നിയമത്തിൽ കീഴിൽ ഉണ്ടാക്കപ്പെട്ടിട്ടുളള ചട്ടങ്ങൾ പ്രകാരം സമ്മാനങ്ങൾ ചേർക്കുന്നതിനായി നിർദ്ദേശിക്കപ്പെട്ടിട്ടുളള ലിസ്റ്റ് സൂക്ഷിച്ചിരിക്കണം.\n" +
                            "വധുവിന് വേണ്ടിയോ, വധുവിനോട് ബന്ധമുളള ആരെങ്കിലുമോ ആചാരപ്രകാരം നൽകുന്ന സമ്മാനങ്ങളുടെ ഗണത്തിൽ പെട്ടതായിരിക്കണം.\n" +
                            "ഇത്തരം സമ്മാനത്തിൻ/// മൂല്യം,കൊടുക്കുന്ന ആളുകളുടെയോ ആർക്കുവേണ്ടിയാണോ കൊടുക്കുന്നത് അവരുടെ സാമ്പത്തിക സാഹചര്യത്തിന് അനുപാതികമല്ലാത്ത തരത്തിലാകരുത്.\n");
                    startActivityForResult( myintent,18);
                }
                if (position==19) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","തൊഴിൽ സ്ഥതത്തെ ലൈംഗിക പീഡനം:-\n" +
                            "വൈശാഖ കേസിലെ സുപ്രീം കോടതി വിധി\n" +
                            "തൊഴിൽ സ്ഥലത്ത് സ്ത്രീകൾക്ക് ലൈംഗിക പീഡനം നേരിടുന്ന കാലഘട്ടത്തിലാണ് നാം ജീവിക്കുന്നത്.ഈ പശ്ചാത്തലത്തിലാണ്1997ൽ ഇന്ത്യൻ സുപ്രീം കോടതി പുറപ്പെടുവിച്ച വിധിന്യായത്തിൻ/// പ്രസക്തി മനസ്സിലാകുന്നത്.\n" +
                            "     തൊഴിൽ മേഖലയിൽ സ്ത്രീ-പുരുഷ സമത്വം ഉറപ്പുവരുത്തുക വഴി സ്ത്രീകളോടുളള വിവേചനം അവസാനിപ്പിക്കുക.കാരണം തൊഴിൽ എടുത്ത് ജീവിക്കുക എന്നത് മനുഷ്യൻ/// അടിസ്ഥാന ആവശ്യമാണ്.സ്ത്രീക്ക് ജന്മദാതാവ് എന്ന നിലയിലുളള സംരക്ഷണമുൾപ്പെടെയുളള സുരക്ഷിതത്വവും ആരോഗ്യ കാരണങ്ങളിലുളള സംരക്ഷണവും ജോലി സ്ഥലത്ത് സുരക്ഷിതത്വ ബോധവും ഉണ്ടാക്കുക.\n");
                    startActivityForResult( myintent,19);
                }
                if (position==20) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","ലൈംഗിക പീഡനങ്ങൾ എന്തൊക്കെ ഉൾപ്പെടും\n" +
                            "ലൈംഗിക ആഗ്രഹം പ്രകടിപ്പിച്ചു കൊണ്ട് സ്വാഗതം ചെയ്യപ്പെടാത്ത ശരീര സ്പർശവും പ്രവ്യത്തികളും\n" +
                            "ലൈംഗികച്ചുവ കലർന്ന സംസാരം\n" +
                            "അശ്ലീല സാഹിത്യ പ്രദർശനം.\n" +
                            "ലൈംഗികത കലർന്ന വാക്കോ നോട്ടമോ വഴിയുളള അദ്യർത്ഥന.\n" +
                            "  തൊഴിൽ സ്ഥലത്ത് മേൽ നോട്ടം വഹിക്കുന്ന എല്ലാ തൊഴിലുടമകളും വ്യക്തികളും സ്വകാര്യ മേഖലയിലെയും പൊതുമേഖലകളിലെയും ഇത്തരം പൊരുമാറ്റങ്ങൾ തടയാനുളള മാർഗ്ഗങ്ങൾ സ്വീകരിക്കണം.\n");
                    startActivityForResult( myintent,20);
                }
                if (position==21) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","സ്ഥലപരിശോധനയും ശരീര പരിശോധനയും \n" +
                            "      ഒരു സ്ത്രീ തനിച്ചു താമസിക്കുന്ന സ്ഥലത്ത് പോലിസിന് പരിശോധിക്കേണ്ട സാഹചാര്യം ഉണ്ടായാൽ ആ സ്ത്രീക്ക് അവിടെ നിന്നും പിൻമാറാൻ സ്വാതന്ത്ര്യമുണ്ടെന്ന് അറിയിപ്പു നൽകുകയും പിൻമാറുവാൻ അവർക്ക് ന്യായമായ സൌകര്യം ചെയ്തു കൊടുക്കുകയും ചെയ്ത ശേഷമേ  മേൽ സ്ഥലത്തെ മുറികളും മറ്റും ബലം പ്രയോഗിച്ച് തുറക്കുവാൻ പാടുളളൂ എന്ന് ക്രിമിനൽ നടപടി നിയമത്തിൽ 47-ാം വകുപ്പു(2) ഉപവകുപ്പിൽ പറയുന്നുണ്ട്.\n" +
                            "    ഒരു സ്ത്രീയുടെ ശരിര പരിശോദന ചെയ്യേണ്ടത് ആവശ്യമായി വരുമ്പോൾ സദ്യത മാനിച്ച്കൊണ്ട് മറ്റൊരു സ്ത്രീയെ കൊണ്ടായിരിക്കണം ആ പരിശോധന നടത്തേണ്ടത് എന്ന് 51-ാം വകുപ്പിൽ നിബന്ധന ഉണ്ട്.ശരിര പരിശോധനയിലൂടെ കുറ്റം ചെയ്തതിനെ സംബന്ധിച്ച തെളിവ് ലഭിക്കുമെന്ന് കരുതുന്നുവെങ്കിൽ ഒരു സ്ത്രീയുടെ ശരീരം പരിശോധിക്കേണ്ടത് രജിസ്റ്റർ ചെയ്യപ്പെട്ട ഒരു വനിതാഡോക്ടറെക്കൊണ്ടോ അവരുടെ മേൽനോട്ടത്തിലോ ആകണം.\n");
                    startActivityForResult( myintent,21);
                }
                if (position==22) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","തെളിവ് നൽകുന്നതിന് സ്റ്റേഷനിൽ ഹാജരാക്കൽ\n" +
                            "കേസന്വേഷണം നടത്തുന്ന പോലിസ് ഉദ്യോഗസ്ഥന് ഒരാളോട് തൻ/// മുമ്പാകെ ഹാജരാകാൻ രേഖാമൂലം ആവശ്യപ്പെടാവുന്നതാണ്.അങ്ങിനെയുളള ആൾ ഉദ്യോഗസ്ഥൻ// മുൻപാകെ ഹാജരാകേണ്ടതാണ് എന്ന് 160-ാം വകുപ്പ് പറയുന്നു.എന്നാൽ സ്ത്രീയോ 15 വയസ്സിൽ താഴെയുളള ആൺകുട്ടിയേയോ സ്റ്റേഷനിലേക്കോ മറ്റു സ്ഥലങ്ങളിലേക്കോ വരാൻ ആവശ്യപ്പെട്ടുകുടാ എന്നും വ്യവസ്ഥ വകുപ്പിൽ ഉണ്ട്.മേൽ പറഞ്ഞവരെ അവർ എവിടെയാണോ ഉളളത് അവിടെ ചെന്ന് ചോദ്യം ചെയ്യണം എന്നാണ് മേൽ വകുപ്പിൽ പറയുന്നത്.\n");
                    startActivityForResult( myintent,22);
                }
                if (position==23) {
                    Intent myintent = new Intent(view.getContext(),Scrolling1Activity.class);
                    myintent.putExtra("id","ഗാർഹിക പീഡന നിരോധന നിയമം\n" +
                            "ഒരു വീട്ടിൽ താമസിക്കുന്ന രക്തബന്ധത്തിൽപെട്ടവരോ, വിവാഹബന്ധത്തിൽപെട്ടവരോ ആയ ഒരു സ്ത്രീക്ക് അവർ താമസിക്കുന്ന വീട്ടിൽവച്ച് ആ വീട്ടിലെ പ്രയപൂർത്തിയായ പുരുഷനിൽ നിന്നും നേരിടുന്ന പീഡനമാണ് ഈ നിയമത്തിൻ/// പരിധിയിൽ വരുന്നത്.കൂട്ടുകുടുംബാംഗം, സഹോദരി, വിധവ, അമ്മ, അവിവാഹിത ഇങ്ങിനെയുളള ബന്ധത്തിൽ വരുന്ന പുരുഷൻ//// കൂടെ താമസിക്കുന്ന എല്ലാ സ്ത്രീകൾക്കും നിയമം പരിപൂർണ്ണ സംരക്ഷണം ഉറപ്പുനൽകുന്നുണ്ട്.ഈ നിയമപ്രകാരം പീഡനം എന്നത് അധിക്ഷേപികികുക(ചീത്തപറയുക) എന്നതും ഉൾപ്പെടുന്നു.ഇത്തരം പ്രവ്യത്തികൾ ശാരീരികമാകാം മാനസികമാകാം,ലൈംഗികമാകാം,വൈകാരികമാകാം.സാമ്പത്തികമാകാം. അഥവാ ഒരു സ്ത്രീയെ അവരുടെ ഗൃഹാന്തരിക്ഷത്തിലുളള പുരുഷൻ വൈകാരികമായോ, ലൈംഗികമായോ ഏൽപിക്കുന്ന ക്ഷതമാണ് ഗാർഹിക പീഡനം എന്നത്കൊണ്ട് ഉദ്ദേശിക്കുന്നത്.\n" +
                            "      കുടുംബത്തിൽപെട്ട സ്ത്രീകളെ നിരാലംബരാക്കി വഴിയിൽ ഇറക്കി വിടുന്നതും  ഈ നിയമം തടയുന്നു.അത്തരം സാഹചര്യങ്ങളിൽ സ്ത്രീക്ക് താമസ സൌകര്യം ഉറപ്പുവരുത്തുന്നതിനാവിശ്യമായ ഉത്തരവ്  പുറപ്പെടുവിക്കാൻ മജിസ്ട്രേറ്റുമാർക്ക് നിയമം അധികാരം നൽകുന്നു. പരാതിക്കാരിയുടെ മുറിയിൽ പ്രവേശിക്കുന്നതിനും  പരാതിക്കാരിയുടെതിർകക്ഷി ശല്യം ചെയ്യുന്നതിനെതിരെയും വിലക്കുകൾ പ്രഖ്യാപിക്കാൻ മജിസ്ട്രേറ്റിന് അധികാരം ഈ നിയമം നൽകുന്നു. ഭാര്യാ ഭർത്താവും ഒന്നിച്ച് താമസിക്കുന്ന സമയത്ത് അല്ലെങ്കിൽ ബന്ധുക്കൾ ഒരുമിച്ചു താമസിക്കുന്ന സമയത്തുളള സ്വത്തുക്കളോ ബാങ്ക് ലോക്കറുകളോ മറ്റ് ആസ്തികളോ അന്യാധിനപ്പെടുത്തുന്നത് തടയാനും ഒരാൾ മാത്രം ഉപയോഗിക്കുന്നത് തടയുന്നതിനും  ഈ നിയമത്തിൽ വ്യവസ്ഥയുണ്ട്.ഒരു സ്ത്രീക്ക് അവരുടെ  ബന്ധുക്കളിൽ നിന്നും നേരിടേണ്ടിവരുന്ന എല്ലാ വിഷമാവസ്ഥകൾക്കും നിയമപരമായി ഇതുവരെ ലഭ്യമാകാതിരുന്ന നിയമപരിരക്ഷ ഈ നിയമ പ്രകാരം ലഭിക്കുന്നുണ്ട് എന്നതാണ്  ഈ നിയമത്തിൻ/// ഏറ്റവും വലിയ പ്രത്യേകത.\n" +
                            "    പരാതിക്കാരി താമസ്സിക്കുന്ന സ്ഥലം, പരാതിക്കാധാരമായ സംഭവം നടന്ന സ്ഥലം, എതിർ കക്ഷി താമസിക്കുന്ന സ്ഥലം എന്നിവയിലേതെങ്കിലും ഒരു സ്ഥലത്തുളള ജുഡീഷ്യൽ ഒന്നാം ക്ലാസ്  മജിസ്ട്രേറ്റ് കോടതിയിലാണ് പരാതി നൽകേണ്ടത്.ഇത്തരം പരാതിയിൽ മജിസ്ട്രേറ്റ് എടുക്കുന്ന തീരുമാനത്തിന് അപ്പീൽ ഓർഡർ ലഭിച്ച് 30 ദിവസത്തിനകം സെഷൻ ജഡ്ജ് മുൻപാകെയാണ്.\n");
                    startActivityForResult( myintent,23);
                }



                int itemPosition     = position;


              String  itemValue    = (String) listView.getItemAtPosition(position);


                Toast.makeText(getApplicationContext(),
                        "Position :"+itemPosition+"  ListItem : " +itemValue , Toast.LENGTH_LONG)
                        .show();

            }


        });



    }}
